# Abrir un archivo

In [13]:
import pandas as pd

In [21]:
dataset = pd.read_csv("titanic.csv",skip_blank_lines=False)

In [22]:
dataset.head(3)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

### Leer un data set desde una ubicación especifica

In [ ]:
dataset = pd.read_csv(filepath_or_buffer ="C:/Users/J053_/Documents/Machine%learning/Leer%Archivo/titanic.csv")

### Sep
Cambiar de separador en los archivos que se lee, puede agregar una expresión regular

In [ ]:
data = pd.read_csv('titanic3.csv', sep="|")

### header
Indica que fila va ser la cabecera

In [ ]:
data = pd.read_csv('titanic3.csv', header=0)

### name 
Agrega un array con los nombres del head

In [ ]:
data = pd.read_csv('titanic3.csv', name={"ingresos","edad"})

### skiprows
Salta un determinado numero de columnas

In [ ]:
data = pd.read_csv('titanic3.csv', skiprows=12, index_col)

### index_col
Indica a que columna debe ser el index

In [ ]:
data = pd.read_csv('titanic3.csv', skiprows=12, index_col=None)

### sikp_blank_lines
Valor booleano, las lineas en blanco se que están en el fichero se saltaran, no las va a tomar como NaN

In [ ]:
data = pd.read_csv('titanic3.csv', skiprows=12, skip_blank_lines=True)

### na_filter
Valor booleano, Detecta los marcadores valores que faltan, y los elimina del data set

In [ ]:
data = pd.read_csv('titanic3.csv', na_filter=True)